###################################################################

# Created by write_sdc on Sat Nov 16 20:22:36 2024

###################################################################
set sdc_version 1.7

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_max_fanout 4 [current_design]
set_max_area 0
set_driving_cell -lib_cell INVX1TS [get_ports clk]
set_driving_cell -lib_cell INVX1TS [get_ports rst]
set_driving_cell -lib_cell INVX1TS [get_ports {op_sel[1]}]
set_driving_cell -lib_cell INVX1TS [get_ports {op_sel[0]}]
set_driving_cell -lib_cell INVX1TS [get_ports {a[15]}]
set_driving_cell -lib_cell INVX1TS [get_ports {a[14]}]
set_driving_cell -lib_cell INVX1TS [get_ports {a[13]}]
set_driving_cell -lib_cell INVX1TS [get_ports {a[12]}]
set_driving_cell -lib_cell INVX1TS [get_ports {a[11]}]
set_driving_cell -lib_cell INVX1TS [get_ports {a[10]}]
set_driving_cell -lib_cell INVX1TS [get_ports {a[9]}]
set_driving_cell -lib_cell INVX1TS [get_ports {a[8]}]
set_driving_cell -lib_cell INVX1TS [get_ports {a[7]}]
set_driving_cell -lib_cell INVX1TS [get_ports {a[6]}]
set_driving_cell -lib_cell INVX1TS [get_ports {a[5]}]
set_driving_cell -lib_cell INVX1TS [get_ports {a[4]}]
set_driving_cell -lib_cell INVX1TS [get_ports {a[3]}]
set_driving_cell -lib_cell INVX1TS [get_ports {a[2]}]
set_driving_cell -lib_cell INVX1TS [get_ports {a[1]}]
set_driving_cell -lib_cell INVX1TS [get_ports {a[0]}]
set_driving_cell -lib_cell INVX1TS [get_ports {b[15]}]
set_driving_cell -lib_cell INVX1TS [get_ports {b[14]}]
set_driving_cell -lib_cell INVX1TS [get_ports {b[13]}]
set_driving_cell -lib_cell INVX1TS [get_ports {b[12]}]
set_driving_cell -lib_cell INVX1TS [get_ports {b[11]}]
set_driving_cell -lib_cell INVX1TS [get_ports {b[10]}]
set_driving_cell -lib_cell INVX1TS [get_ports {b[9]}]
set_driving_cell -lib_cell INVX1TS [get_ports {b[8]}]
set_driving_cell -lib_cell INVX1TS [get_ports {b[7]}]
set_driving_cell -lib_cell INVX1TS [get_ports {b[6]}]
set_driving_cell -lib_cell INVX1TS [get_ports {b[5]}]
set_driving_cell -lib_cell INVX1TS [get_ports {b[4]}]
set_driving_cell -lib_cell INVX1TS [get_ports {b[3]}]
set_driving_cell -lib_cell INVX1TS [get_ports {b[2]}]
set_driving_cell -lib_cell INVX1TS [get_ports {b[1]}]
set_driving_cell -lib_cell INVX1TS [get_ports {b[0]}]
set_load -pin_load 0.005 [get_ports {result[31]}]
set_load -pin_load 0.005 [get_ports {result[30]}]
set_load -pin_load 0.005 [get_ports {result[29]}]
set_load -pin_load 0.005 [get_ports {result[28]}]
set_load -pin_load 0.005 [get_ports {result[27]}]
set_load -pin_load 0.005 [get_ports {result[26]}]
set_load -pin_load 0.005 [get_ports {result[25]}]
set_load -pin_load 0.005 [get_ports {result[24]}]
set_load -pin_load 0.005 [get_ports {result[23]}]
set_load -pin_load 0.005 [get_ports {result[22]}]
set_load -pin_load 0.005 [get_ports {result[21]}]
set_load -pin_load 0.005 [get_ports {result[20]}]
set_load -pin_load 0.005 [get_ports {result[19]}]
set_load -pin_load 0.005 [get_ports {result[18]}]
set_load -pin_load 0.005 [get_ports {result[17]}]
set_load -pin_load 0.005 [get_ports {result[16]}]
set_load -pin_load 0.005 [get_ports {result[15]}]
set_load -pin_load 0.005 [get_ports {result[14]}]
set_load -pin_load 0.005 [get_ports {result[13]}]
set_load -pin_load 0.005 [get_ports {result[12]}]
set_load -pin_load 0.005 [get_ports {result[11]}]
set_load -pin_load 0.005 [get_ports {result[10]}]
set_load -pin_load 0.005 [get_ports {result[9]}]
set_load -pin_load 0.005 [get_ports {result[8]}]
set_load -pin_load 0.005 [get_ports {result[7]}]
set_load -pin_load 0.005 [get_ports {result[6]}]
set_load -pin_load 0.005 [get_ports {result[5]}]
set_load -pin_load 0.005 [get_ports {result[4]}]
set_load -pin_load 0.005 [get_ports {result[3]}]
set_load -pin_load 0.005 [get_ports {result[2]}]
set_load -pin_load 0.005 [get_ports {result[1]}]
set_load -pin_load 0.005 [get_ports {result[0]}]
set_max_capacitance 0.005 [get_ports clk]
set_max_capacitance 0.005 [get_ports rst]
set_max_capacitance 0.005 [get_ports {op_sel[1]}]
set_max_capacitance 0.005 [get_ports {op_sel[0]}]
set_max_capacitance 0.005 [get_ports {a[15]}]
set_max_capacitance 0.005 [get_ports {a[14]}]
set_max_capacitance 0.005 [get_ports {a[13]}]
set_max_capacitance 0.005 [get_ports {a[12]}]
set_max_capacitance 0.005 [get_ports {a[11]}]
set_max_capacitance 0.005 [get_ports {a[10]}]
set_max_capacitance 0.005 [get_ports {a[9]}]
set_max_capacitance 0.005 [get_ports {a[8]}]
set_max_capacitance 0.005 [get_ports {a[7]}]
set_max_capacitance 0.005 [get_ports {a[6]}]
set_max_capacitance 0.005 [get_ports {a[5]}]
set_max_capacitance 0.005 [get_ports {a[4]}]
set_max_capacitance 0.005 [get_ports {a[3]}]
set_max_capacitance 0.005 [get_ports {a[2]}]
set_max_capacitance 0.005 [get_ports {a[1]}]
set_max_capacitance 0.005 [get_ports {a[0]}]
set_max_capacitance 0.005 [get_ports {b[15]}]
set_max_capacitance 0.005 [get_ports {b[14]}]
set_max_capacitance 0.005 [get_ports {b[13]}]
set_max_capacitance 0.005 [get_ports {b[12]}]
set_max_capacitance 0.005 [get_ports {b[11]}]
set_max_capacitance 0.005 [get_ports {b[10]}]
set_max_capacitance 0.005 [get_ports {b[9]}]
set_max_capacitance 0.005 [get_ports {b[8]}]
set_max_capacitance 0.005 [get_ports {b[7]}]
set_max_capacitance 0.005 [get_ports {b[6]}]
set_max_capacitance 0.005 [get_ports {b[5]}]
set_max_capacitance 0.005 [get_ports {b[4]}]
set_max_capacitance 0.005 [get_ports {b[3]}]
set_max_capacitance 0.005 [get_ports {b[2]}]
set_max_capacitance 0.005 [get_ports {b[1]}]
set_max_capacitance 0.005 [get_ports {b[0]}]
set_max_fanout 4 [get_ports clk]
set_max_fanout 4 [get_ports rst]
set_max_fanout 4 [get_ports {op_sel[1]}]
set_max_fanout 4 [get_ports {op_sel[0]}]
set_max_fanout 4 [get_ports {a[15]}]
set_max_fanout 4 [get_ports {a[14]}]
set_max_fanout 4 [get_ports {a[13]}]
set_max_fanout 4 [get_ports {a[12]}]
set_max_fanout 4 [get_ports {a[11]}]
set_max_fanout 4 [get_ports {a[10]}]
set_max_fanout 4 [get_ports {a[9]}]
set_max_fanout 4 [get_ports {a[8]}]
set_max_fanout 4 [get_ports {a[7]}]
set_max_fanout 4 [get_ports {a[6]}]
set_max_fanout 4 [get_ports {a[5]}]
set_max_fanout 4 [get_ports {a[4]}]
set_max_fanout 4 [get_ports {a[3]}]
set_max_fanout 4 [get_ports {a[2]}]
set_max_fanout 4 [get_ports {a[1]}]
set_max_fanout 4 [get_ports {a[0]}]
set_max_fanout 4 [get_ports {b[15]}]
set_max_fanout 4 [get_ports {b[14]}]
set_max_fanout 4 [get_ports {b[13]}]
set_max_fanout 4 [get_ports {b[12]}]
set_max_fanout 4 [get_ports {b[11]}]
set_max_fanout 4 [get_ports {b[10]}]
set_max_fanout 4 [get_ports {b[9]}]
set_max_fanout 4 [get_ports {b[8]}]
set_max_fanout 4 [get_ports {b[7]}]
set_max_fanout 4 [get_ports {b[6]}]
set_max_fanout 4 [get_ports {b[5]}]
set_max_fanout 4 [get_ports {b[4]}]
set_max_fanout 4 [get_ports {b[3]}]
set_max_fanout 4 [get_ports {b[2]}]
set_max_fanout 4 [get_ports {b[1]}]
set_max_fanout 4 [get_ports {b[0]}]
set_ideal_network [get_ports clk]
create_clock [get_ports clk]  -period 2  -waveform {0 1}
set_clock_uncertainty 0  [get_clocks clk]
set_clock_transition -max -rise 0.01 [get_clocks clk]
set_clock_transition -max -fall 0.01 [get_clocks clk]
set_clock_transition -min -rise 0.01 [get_clocks clk]
set_clock_transition -min -fall 0.01 [get_clocks clk]
set_input_delay -clock clk  0.05  [get_ports rst]
set_input_delay -clock clk  0.05  [get_ports {op_sel[1]}]
set_input_delay -clock clk  0.05  [get_ports {op_sel[0]}]
set_input_delay -clock clk  0.05  [get_ports {a[15]}]
set_input_delay -clock clk  0.05  [get_ports {a[14]}]
set_input_delay -clock clk  0.05  [get_ports {a[13]}]
set_input_delay -clock clk  0.05  [get_ports {a[12]}]
set_input_delay -clock clk  0.05  [get_ports {a[11]}]
set_input_delay -clock clk  0.05  [get_ports {a[10]}]
set_input_delay -clock clk  0.05  [get_ports {a[9]}]
set_input_delay -clock clk  0.05  [get_ports {a[8]}]
set_input_delay -clock clk  0.05  [get_ports {a[7]}]
set_input_delay -clock clk  0.05  [get_ports {a[6]}]
set_input_delay -clock clk  0.05  [get_ports {a[5]}]
set_input_delay -clock clk  0.05  [get_ports {a[4]}]
set_input_delay -clock clk  0.05  [get_ports {a[3]}]
set_input_delay -clock clk  0.05  [get_ports {a[2]}]
set_input_delay -clock clk  0.05  [get_ports {a[1]}]
set_input_delay -clock clk  0.05  [get_ports {a[0]}]
set_input_delay -clock clk  0.05  [get_ports {b[15]}]
set_input_delay -clock clk  0.05  [get_ports {b[14]}]
set_input_delay -clock clk  0.05  [get_ports {b[13]}]
set_input_delay -clock clk  0.05  [get_ports {b[12]}]
set_input_delay -clock clk  0.05  [get_ports {b[11]}]
set_input_delay -clock clk  0.05  [get_ports {b[10]}]
set_input_delay -clock clk  0.05  [get_ports {b[9]}]
set_input_delay -clock clk  0.05  [get_ports {b[8]}]
set_input_delay -clock clk  0.05  [get_ports {b[7]}]
set_input_delay -clock clk  0.05  [get_ports {b[6]}]
set_input_delay -clock clk  0.05  [get_ports {b[5]}]
set_input_delay -clock clk  0.05  [get_ports {b[4]}]
set_input_delay -clock clk  0.05  [get_ports {b[3]}]
set_input_delay -clock clk  0.05  [get_ports {b[2]}]
set_input_delay -clock clk  0.05  [get_ports {b[1]}]
set_input_delay -clock clk  0.05  [get_ports {b[0]}]
set_output_delay -clock clk  0.05  [get_ports {result[31]}]
set_output_delay -clock clk  0.05  [get_ports {result[30]}]
set_output_delay -clock clk  0.05  [get_ports {result[29]}]
set_output_delay -clock clk  0.05  [get_ports {result[28]}]
set_output_delay -clock clk  0.05  [get_ports {result[27]}]
set_output_delay -clock clk  0.05  [get_ports {result[26]}]
set_output_delay -clock clk  0.05  [get_ports {result[25]}]
set_output_delay -clock clk  0.05  [get_ports {result[24]}]
set_output_delay -clock clk  0.05  [get_ports {result[23]}]
set_output_delay -clock clk  0.05  [get_ports {result[22]}]
set_output_delay -clock clk  0.05  [get_ports {result[21]}]
set_output_delay -clock clk  0.05  [get_ports {result[20]}]
set_output_delay -clock clk  0.05  [get_ports {result[19]}]
set_output_delay -clock clk  0.05  [get_ports {result[18]}]
set_output_delay -clock clk  0.05  [get_ports {result[17]}]
set_output_delay -clock clk  0.05  [get_ports {result[16]}]
set_output_delay -clock clk  0.05  [get_ports {result[15]}]
set_output_delay -clock clk  0.05  [get_ports {result[14]}]
set_output_delay -clock clk  0.05  [get_ports {result[13]}]
set_output_delay -clock clk  0.05  [get_ports {result[12]}]
set_output_delay -clock clk  0.05  [get_ports {result[11]}]
set_output_delay -clock clk  0.05  [get_ports {result[10]}]
set_output_delay -clock clk  0.05  [get_ports {result[9]}]
set_output_delay -clock clk  0.05  [get_ports {result[8]}]
set_output_delay -clock clk  0.05  [get_ports {result[7]}]
set_output_delay -clock clk  0.05  [get_ports {result[6]}]
set_output_delay -clock clk  0.05  [get_ports {result[5]}]
set_output_delay -clock clk  0.05  [get_ports {result[4]}]
set_output_delay -clock clk  0.05  [get_ports {result[3]}]
set_output_delay -clock clk  0.05  [get_ports {result[2]}]
set_output_delay -clock clk  0.05  [get_ports {result[1]}]
set_output_delay -clock clk  0.05  [get_ports {result[0]}]
